<?php

return [
    'generic' => [
        'greeting' => 'Здравствуйте!',
        'personalized_greeting' => 'Здравствуйте, :user!',
        'auto_notification_info' => 'Уведомление сформировано автоматически. Отвечать на него не требуется.',
        'action_link_info' => 'Не нажимается кнопка «:actionText»? Скопируйте и вставьте в браузер эту ссылку:',
        'regards' => 'С уважением,',
        'all_rights_reserved' => 'Все права защищены.',
    ],
    'register' => [
        'email_verification' => [
            'subject' => 'Подтверждение регистрации на сайте',
            'summary' => 'Поступила заявка на регистрацию пользователя в **блоге Лики Вуле** на данную электронную почту.',
            'reason_to_act' => 'Чтобы подтвердить заявку, нажмите на кнопку ниже.',
            'action' => 'Подтвердить заявку',
            'footer' => 'Если Вы не запрашивали изменение электронной почты, проигнорируйте это письмо: заявка будет автоматически отклонена.',
        ],
    ],
    'user' => [
        'email_change' => [
            'new_sent_successfully' => 'Письмо для подтверждения отправлено! Проверьте вашу электронную почту.',
            'new_verified_successfully' => 'Новая электронная почта успешно подтверждена!',
            'check_old_email' => 'Проверьте вашу текущую электронную почту для завершения процесса.',
            'confirmed_successfully' => 'Электронная почта успешно изменена!',
            'email_changed_successfully' => 'Электронная почта успешно изменена!',
            'resent_successfully' => 'Письмо успешно отправлено повторно!',
            'cancelled_successfully' => 'Процесс смены электронной почты отменён.',
        ],
        'errors' => [
            'password_cooldown_active' => "Невозможно изменить вашу электронную почту, поскольку вы недавно поменяли пароль. Попробуйте позже.",
            'email_cooldown_active' => "Невозможно изменить вашу электронную почту, поскольку вы недавно её меняли. Попробуйте позже.",
            'request_cooldown_active' => "Невозможно изменить вашу электронную почту, поскольку вы недавно отменили запрос на её изменение. Попробуйте позже.",
            'request_currently_active' => "У Вас уже активен запрос на изменение электронной почты. Пожалуйста, отмените или завершите его.",
            'token_expired' => "Срок действия ссылки истёк. Пожалуйста, запросите новую ссылку.",
            'token_not_found' => "Некорректная ссылка. Пожалуйста, проверьте её правильность или запросите новую."
        ],
        'deletion_grace_impending' => [
            'subject' => 'Ваш профиль будет удалён через :days_left',
            'days_left' => '[...5-14] :count дней|[...1] :count день|[...2-4] :count дня|:count дней',
            'summary' => 'Ваша учётная запись в **блоге Лики Вуле** будет удалена через :days_left в соответствии с Вашим запросом.',
            'reason_to_act' => 'Нажмите на кнопку ниже, чтобы отменить запрос на удаление, если Вы передумали.',
            'action' => 'Отменить удаление',
        ],
        'deletion_grace_started' => [
            'subject' => 'Ваш профиль помечен к удалению',
            'days_left' => '[...5-14] :count дней|[...1] :count день|[...2-4] :count дня|:count дней',
            'summary' => 'Ваша учётная запись в **блоге Лики Вуле** будет удалена через :days_left в соответствии с Вашим запросом.',
            'reason_to_act' => 'Нажмите на кнопку ниже, чтобы отменить запрос на удаление, если Вы передумали.',
            'action' => 'Отменить удаление',
        ],
        'deletion_grace_expired' => [
            'subject' => 'Удаление Вашего профиля завершено',
            'summary' => 'Ваш профиль был полностью удалён из нашей системы. Все Ваши данные, публикации и настройки полностью удалены. Оставленные Вами отзывы и комментарии отображаются как материалы от удалённого пользователя.',
            'reason_to_act' => 'Вы всегда можете вернуться, создав новый профиль.',
            'footer' => 'Всего Вам самого доброго!'
        ],
        'email_change_verify_new' => [
            'subject' => 'Запрос на изменение электронной почты',
            'summary' => 'Поступила заявка на связывание данной электронной почты с профилем пользователя в **блоге Лики Вуле**.',
            'reason_to_act' => 'Чтобы подтвердить заявку, нажмите на кнопку ниже.',
            'action' => 'Подтвердить заявку',
            'footer' => 'Если Вы не запрашивали изменение электронной почты, проигнорируйте это письмо: заявка будет автоматически отклонена.',
        ],
        'email_change_confirm_old' => [
            'subject' => 'Запрос на изменение электронной почты',
            'summary' => 'Получена заявка на изменение электронной почты Вашего профиля.',
            'reason_to_act' => 'Чтобы подтвердить изменение почты, привязанной к Вашему профилю, на **:new_email**, нажмите на кнопку ниже.',
            'action' => 'Подтвердить изменение',
            'footer' => 'Если Вы не запрашивали изменение электронной почты, проигнорируйте это письмо: почта останется прежней, а заявка будет автоматически отклонена.',
        ],
    ],

];
